const config = require('../config');
const moment = require('moment-timezone');
const { cmd, commands } = require('../command');
const axios = require('axios');

function toSmallCaps(str) {
  const smallCaps = {
    A: 'ᴀ', B: 'ʙ', C: 'ᴄ', D: 'ᴅ', E: 'ᴇ', F: 'ғ', G: 'ɢ', H: 'ʜ',
    I: 'ɪ', J: 'ᴊ', K: 'ᴋ', L: 'ʟ', M: 'ᴍ', N: 'ɴ', O: 'ᴏ', P: 'ᴘ',
    Q: 'ǫ', R: 'ʀ', S: 's', T: 'ᴛ', U: 'ᴜ', V: 'ᴠ', W: 'ᴡ', X: 'x',
    Y: 'ʏ', Z: 'ᴢ'
  };
  return str.toUpperCase().split('').map(c => smallCaps[c] || c).join('');
}

cmd({
  pattern: "menu",
  alias: ["👑"],
  use: '.menu',
  desc: "Show all bot commands",
  category: "menu",
  react: "🪃",
  audio: { mp3: 'https://files.catbox.moe/6ifekx.mp3' },
  filename: __filename
},
async (haiko, mek, m, { from, reply }) => {
  try {
    const totalCommands = commands.length;
    const date = moment().tz("America/Mexico").format("dddd, DD MMMM YYYY");

    const uptime = () => {
      let sec = process.uptime();
      let h = Math.floor(sec / 3600);
      let m = Math.floor((sec % 3600) / 60);
      let s = Math.floor(sec % 60);
      return `${h}h ${m}m ${s}s`;
    };

    let haikomenu = `╭∘━━➤ *𝐇𝐀𝐈𝐊𝐎-𝐌𝐃𝐗-𝐕𝟐*
┃╭•─────────────⊷
┃│❍ *ᴜsᴇʀ* : *@${m.sender.split("@")[0]}*
┃│❍ *ᴛɪᴍᴇ* : *${uptime()}*
┃│❍ *ᴍᴏᴅᴇ* : *${config.MODE}*
┃│❍ *ᴘʀᴇғɪx* : *[${config.PREFIX}]*
┃│❍ *ᴅᴇᴠᴇʟᴏᴘᴇʀ* : *`xᴛʀᴇᴍᴇ`*
┃│❍ *ᴘʟᴜɢɪɴs* :  *${totalCommands}*
┃│❍ *ᴠᴇʀsɪᴏɴ* : *`2.0.0`*
┃╰•─────────────⊷
╰∘━━━━━━━━━━━━━━━━∘╯
> *ᴍᴜʟᴛɪ ᴅᴇᴠɪᴄᴇ ᴡᴀ ʙᴏᴛ ʙʏ xᴛʀᴇᴍᴇ*
> *`ᴇɴᴊᴏʏ ᴛʜᴇ ʙᴏᴛ`*
> *╭⭑━━━━━➤*
> *┃* *`𝐃𝐎𝐖𝐍𝐋𝐎𝐀𝐃 𝐌𝐄𝐍𝐔`*
> *┣➢*  ғᴀᴄᴇʙᴏᴏᴋ
> *┣➢*  ᴍᴇᴅɪᴀғɪʀᴇ
> *┣➢*  ᴛɪᴋᴛᴏᴋ
> *┣➢*  ᴛᴡɪᴛᴛᴇʀ
> *┣➢*  ɪɴsᴛᴀ
> *┣➢*  ᴀᴘᴋ
> *┣➢*  ɪᴍɢ
> *┣➢*  ᴛᴛ2
> *┣➢*  ᴘɪɴs
> *┣➢*  ᴀᴘᴋ2
> *┣➢*  ғʙ2
> *┣➢*  ᴘɪɴᴛᴇʀᴇsᴛ
> *┣➢*  sᴘᴏᴛɪғʏ
> *┣➢*  ᴘʟᴀʏ
> *┣➢*  ᴘʟᴀʏ2
> *┣➢*  ᴀᴜᴅɪᴏ
> *┣➢*  ᴠɪᴅᴇᴏ
> *┣➢*  ᴠɪᴅᴇᴏ2
> *┣➢*  ʏᴛᴍᴘ3
> *┣➢*  ʏᴛᴍᴘ4
> *┣➢*  sᴏɴɢ
> *┣➢*  ᴅᴀʀᴀᴍᴀ
> *┣➢* ɢᴅʀɪᴠᴇ
> *┣➢*  ssᴡᴇʙ
> *┣➢*  ᴛɪᴋs
> *╰⭑━━➤* *𝚆𝙰 𝙱𝙾𝚃 𝟸𝟶𝟸𝟻-𝟸𝟶𝟸𝟼*

> *╭⭑━━━━━➤*
> *┃* *`𝐑𝐄𝐀𝐂𝐓𝐈𝐎𝐍𝐒 𝐌𝐄𝐍𝐔`*
> *┣➢*  ʙᴜʟʟʏ 
> *┣➢*  ᴄᴜᴅᴅʟᴇ 
> *┣➢*  ᴄʀʏ 
> *┣➢*  ʜᴜɢ
> *┣➢*  ᴀᴡᴏᴏ 
> *┣➢*  ᴋɪss 
> *┣➢*  ʟɪᴄᴋ 
> *┣➢*  ᴘᴀᴛ 
> *┣➢*  sᴍᴜɢ 
> *┣➢*  ʙᴏɴᴋ 
> *┣➢*  ʜɪɢʜғɪᴠᴇ 
> *┣➢*  ʜᴀɴᴅʜᴏʟᴅ 
> *┣➢*  ɴᴏᴍ 
> *┣➢*  ʙɪᴛᴇ 
> *┣➢*  ɢʟᴏᴍᴘ 
> *┣➢*  sʟᴀᴘ 
> *┣➢*  ᴋɪʟʟ 
> *┣➢*  ʜᴀᴘᴘʏ 
> *┣➢*  ᴡɪɴᴋ 
> *┣➢*  ᴘᴏᴋᴇ 
> *┣➢*  ᴅᴀɴᴄᴇ 
> *┣➢*  ᴄʀɪɴɢᴇ 
> *╰⭑━━➤* *𝚆𝙰 𝙱𝙾𝚃 𝟸𝟶𝟸𝟻-𝟸𝟶𝟸𝟼*

> *╭⭑━━━━━➤* 
> *┃* *`𝐆𝐑𝐎𝐔𝐏 𝐌𝐄𝐍𝐔`*
> *┣➢*  ɢʀᴏᴜᴘʟɪɴᴋ
> *┣➢*  ᴋɪᴄᴋᴀʟʟ
> *┣➢*  ᴋɪᴄᴋᴀʟʟ2
> *┣➢*  ᴋɪᴄᴋᴀʟʟ3
> *┣➢*  ᴀᴅᴅ
> *┣➢*  ᴀɴᴛɪsᴘᴀᴍ
> *┣➢*  ᴀɴᴛɪʙᴏᴛ
> *┣➢*  ᴀɴᴛɪᴍᴇɴᴛɪᴏɴ
> *┣➢*  ʀᴇᴍᴏᴠᴇ
> *┣➢*  ᴋɪᴄᴋ
> *┣➢*  ᴘʀᴏᴍᴏᴛᴇ
> *┣➢*  ᴅᴇᴍᴏᴛᴇ 
> *┣➢*  ᴅɪsᴍɪss 
> *┣➢*  ʀᴇᴠᴏᴋᴇ 
> *┣➢*  sᴇᴛɢᴏᴏᴅʙʏᴇ 
> *┣➢*  sᴇᴛᴡᴇʟᴄᴏᴍᴇ 
> *┣➢*  ᴅᴇʟᴇᴛᴇ 
> *┣➢*  ɢᴇᴛᴘɪᴄ 
> *┣➢*  ɢɪɴғᴏ 
> *┣➢*  ᴅɪsᴀᴘᴘᴇᴀʀ ᴏɴ 
> *┣➢*  ᴅɪsᴀᴘᴘᴇᴀʀ ᴏғғ
> *┣➢*  ᴅɪsᴀᴘᴘᴇᴀʀ 7D,24H
> *┣➢*  ᴀʟʟʀᴇǫ
> *┣➢*  ᴜᴘᴅᴀᴛᴇɢɴᴀᴍᴇ
> *┣➢*  ᴜᴘᴅᴀᴛᴇɢᴅᴇsᴄ
> *┣➢*  ᴊᴏɪɴʀᴇǫᴜᴇsᴛs
> *┣➢*  sᴇɴᴅᴅᴍ
> *┣➢*  ɴɪᴋᴀʟ
> *┣➢*  ᴍᴜᴛᴇ
> *┣➢*  ᴜɴᴍᴜᴛᴇ
> *┣➢*  ʟᴏᴄᴋɢᴄ
> *┣➢*  ᴜɴʟᴏᴄᴋɢᴄ
> *┣➢*  ɪɴᴠɪᴛᴇ
> *┣➢*  ᴛᴀɢ
> *┣➢*  ʜɪᴅᴇᴛᴀɢ
> *┣➢*  ᴛᴀɢᴀʟʟ
> *┣➢*  ᴛᴀɢᴀᴅᴍɪɴs
> *╰⭑━━➤* *𝚆𝙰 𝙱𝙾𝚃 𝟸𝟶𝟸𝟻-𝟸𝟶𝟸𝟼*

> *╭⭑━━━━━➤*
> *┃* *`𝐋𝐎𝐆𝐎 𝐌𝐀𝐊𝐄𝐑`*
> *┣➢*  ɴᴇᴏɴʟɪɢʜᴛ
> *┣➢*  ʙʟᴀᴄᴋᴘɪɴᴋ
> *┣➢*  ᴅʀᴀɢᴏɴʙᴀʟʟ
> *┣➢*  3 ᴅᴄᴏᴍɪᴄ
> *┣➢*  ᴀᴍᴇʀɪᴄᴀ
> *┣➢*  ɴᴀʀᴜᴛᴏ
> *┣➢*  sᴀᴅɢɪʀʟ
> *┣➢*  ᴄʟᴏᴜᴅs
> *┣➢*  ғᴜᴛᴜʀɪsᴛɪᴄ
> *┣➢*  3ᴅᴘᴀᴘᴇʀ
> *┣➢*  ɢᴀʟᴀxʏ
> *┣➢*  sᴀɴs
> *┣➢*  ʙᴏᴏᴍ
> *┣➢*  ʜᴀᴄᴋᴇʀ
> *┣➢*  ᴅᴇᴠɪʟᴡɪɴɢs
> *┣➢*  ɴɪɢᴇʀɪᴀ
> *┣➢*  ʙᴜʟʙ
> *┣➢*  ᴛʏᴘᴏɢʀᴀᴘʜʏ
> *┣➢*  ʙɪʀᴛʜᴅᴀʏ
> *╰⭑━━➤* *𝚆𝙰 𝙱𝙾𝚃 𝟸𝟶𝟸𝟻-𝟸𝟶𝟸𝟼*

> *╭⭑━━━━━➤*
> *┃* *`𝐎𝐖𝐍𝐄𝐑 𝐌𝐄𝐍𝐔`*
> *┣➢*  ᴏᴡɴᴇʀ
> *┣➢*  ᴍᴇɴᴜ
> *┣➢*  ᴍᴇɴᴜ2
> *┣➢*  ᴠᴠ
> *┣➢*  ᴄʜᴀᴛʙᴏᴛ
> *┣➢*  ᴘʜᴏᴛᴏ
> *┣➢*  ᴀɴᴛɪᴄᴀʟʟ
> *┣➢*  ʟɪsᴛᴄᴍᴅ
> *┣➢*  ᴀʟʟᴍᴇɴᴜ
> *┣➢*  ʀᴇᴘᴏ
> *┣➢*  ʙʟᴏᴄᴋ
> *┣➢*  ᴜɴʙʟᴏᴄᴋ
> *┣➢*  ғᴜʟʟᴘᴘ
> *┣➢*  sᴇᴛᴘᴘ
> *┣➢*  ᴛᴛᴛ
> *┣➢*  ʀᴇsᴛᴀʀᴛ
> *┣➢*  sʜᴜᴛᴅᴏᴡɴ
> *┣➢*  ᴜᴘᴅᴀᴛᴇᴄᴍᴅ
> *┣➢*  ᴀʟɪᴠᴇ
> *┣➢*  ᴘɪɴɢ
> *┣➢*  ᴊɪᴅ
> *╰⭑━━➤* *𝚆𝙰 𝙱𝙾𝚃 𝟸𝟶𝟸𝟻-𝟸𝟶𝟸𝟼*

> *╭⭑━━━━━➤*
> *┃* *`𝐅𝐔𝐍 𝐌𝐄𝐍𝐔`*
> *┣➢*  sʜᴀᴘᴀʀ
> *┣➢*  ʀᴀᴛᴇ
> *┣➢*  ɪɴsᴜʟᴛ
> *┣➢*  ʜᴀᴄᴋ
> *┣➢*  sʜɪᴘ
> *┣➢*  ᴄʜᴀʀᴀᴄᴛᴇʀ
> *┣➢*  ᴘɪᴄᴋᴜᴘ
> *┣➢*  ᴊᴏᴋᴇ
> *┣➢*  ʜʀᴛ
> *┣➢*  ʜᴘʏ
> *┣➢*  sʏᴅ
> *┣➢*  ᴀɴɢᴇʀ
> *┣➢*  sʜʏ
> *┣➢*  ᴋɪss
> *┣➢*  ʜᴏʟᴅ
> *┣➢*  ʜᴜɢ
> *┣➢*  ɴɪᴋᴀʟ
> *┣➢*  ʜɪғɪ
> *┣➢*  ᴘᴏᴋᴇ
> *╰⭑━━➤* *𝚆𝙰 𝙱𝙾𝚃 𝟸𝟶𝟸𝟻-𝟸𝟶𝟸𝟼*

> *╭⭑━━━━━➤* 
> *┃* *`𝐂𝐎𝐍𝐕𝐄𝐑𝐓 𝐌𝐄𝐍𝐔`*
> *┣➢*  sᴛɪᴄᴋᴇ
> *┣➢*  ᴇᴍᴏᴊɪᴍɪx
> *┣➢*  ғᴀɴᴄʏ
> *┣➢*  ᴛᴀᴋᴇ
> *┣➢*  ᴛᴏᴍᴘ3
> *┣➢*  ᴛᴛs
> *┣➢*  ᴛʀᴛ
> *┣➢*  ʙᴀsᴇ64
> *┣➢*  ᴜɴʙᴀsᴇ64
> *┣➢*  ʙɪɴᴀʀʏ
> *┣➢*  ᴅʙɪɴᴀʀʏ
> *┣➢*  ᴛɪɴʏᴜʀʟ
> *┣➢*  ᴜʀʟᴅᴇᴄᴏᴅᴇ
> *┣➢*  ᴜʀʟ
> *┣➢*  ʀᴇᴘᴇᴀᴛ
> *┣➢*  ᴀsᴋ
> *┣➢*  ʀᴇᴀᴅᴍᴏʀᴇ
> *╰⭑━━➤* *𝚆𝙰 𝙱𝙾𝚃 𝟸𝟶𝟸𝟻-𝟸𝟶𝟸𝟼*

> *╭⭑━━━━━➤* 
> *┃* *`𝐀𝐈 𝐌𝐄𝐍𝐔`*
> *┣➢*  ᴀɪ
> *┣➢*  ɢᴘᴛ3
> *┣➢*  ɢᴘᴛᴍɪɴɪ
> *┣➢* ʜᴀɪᴋᴏ
> *┣➢*  ᴍᴇᴛᴀ
> *┣➢*  ʙʟᴀᴄᴋʙᴏx
> *┣➢*  ʟᴜᴍᴀ
> *┣➢*  ᴅᴊ
> *┣➢*  ʜᴀɪᴋᴏ
> *┣➢*  ᴘʀᴏғ
> *┣➢*  ɢᴘᴛ4
> *┣➢*  ʙɪɴɢ
> *┣➢*  ɪᴍᴀɢɪɴᴇ
> *┣➢*  ɪᴍᴀɢɪɴᴇ2
> *┣➢*  ᴄᴏᴘɪʟᴏᴛ
> *╰⭑━━➤* *𝚆𝙰 𝙱𝙾𝚃 𝟸𝟶𝟸𝟻-𝟸𝟶𝟸𝟼*

> *╭⭑━━━━━➤* 
> *┃* *`𝐌𝐀𝐈𝐍 𝐌𝐄𝐍𝐔`*
> *┣➢*  ᴘɪɴɢ
> *┣➢*  ᴘɪɴɢ2
> *┣➢*  sᴘᴇᴇᴅ
> *┣➢*  ʟɪᴠᴇ
> *┣➢*  ᴀʟɪᴠᴇ
> *┣➢*  ʀᴜɴᴛɪᴍᴇ
> *┣➢*  ᴜᴘᴛɪᴍᴇ
> *┣➢*  ʀᴇᴘᴏ
> *┣➢*  ᴏᴡɴᴇʀ
> *┣➢*  ᴍᴇɴᴜ
> *┣➢*  ᴍᴇɴᴜ2
> *┣➢*  ʀᴇsᴛᴀʀᴛ
> *╰⭑━━➤* *𝚆𝙰 𝙱𝙾𝚃 𝟸𝟶𝟸𝟻-𝟸𝟶𝟸𝟼*

> *╭⭑━━━━━➤* 
> *┃* *`𝐀𝐍𝐈𝐌𝐄 𝐌𝐄𝐍𝐔`*
> *┣➢*  ғᴀᴄᴋ
> *┣➢*  ᴛʀᴜᴛʜ
> *┣➢*  ᴅᴀʀᴇ
> *┣➢*  ᴅᴏɢ
> *┣➢*  ᴀᴡᴏᴏ
> *┣➢*  ɢᴀʀʟ
> *┣➢*  ᴡᴀɪғᴜ
> *┣➢*  ɴᴇᴋᴏ
> *┣➢*  ᴍᴇɢɴᴜᴍɪɴ
> *┣➢*  ɴᴇᴋᴏ
> *┣➢*  ᴍᴀɪᴅ
> *┣➢*  ʟᴏʟɪ
> *┣➢*  ᴀɴɪᴍᴇɢɪʀʟ
> *┣➢*  ᴀɴɪᴍᴇɴᴇᴡs
> *┣➢*  ғᴏxɢɪʀʟ
> *┣➢*  ɴᴀʀᴜᴛᴏ
> *╰⭑━━➤*  *𝚆𝙰 𝙱𝙾𝚃 𝟸𝟶𝟸𝟻-𝟸𝟶𝟸𝟼*

> *╭⭑━━━━━➤* 
> *┃* *`𝐎𝐓𝐇𝐄𝐑 𝐌𝐄𝐍𝐔`*
> *┣➢*  ᴛɪᴍᴇɴᴏᴡ
> *┣➢*  ᴅᴀᴛᴇ
> *┣➢*  ᴄᴏᴜɴᴛ
> *┣➢*  ᴄᴀʟᴄᴜʟᴀᴛᴇ
> *┣➢*  ᴄᴏᴜɴᴛx
> *┣➢*  ғʟɪᴘ
> *┣➢*  ᴄᴏɪɴғʟɪᴘ
> *┣➢*  ʀᴄᴏʟᴏʀ
> *┣➢*  ʀᴏʟʟ
> *┣➢*  ғᴀᴄᴛ
> *┣➢*  ᴄᴘᴘ
> *┣➢*  ʀᴡ
> *┣➢*  ᴘᴀɪʀ
> *┣➢*  ʟᴏɢᴏ <ᴛᴇxᴛ>
> *┣➢*  ᴅᴇғɪɴᴇ
> *┣➢*  ɴᴇᴡs
> *┣➢*  ᴍᴏᴠɪᴇ
> *┣➢*  ᴡᴇᴀᴛʜᴇʀ
> *┣➢*  sʀᴇᴘᴏ
> *┣➢*  ɪɴsᴜʟᴛ
> *┣➢*  sᴀᴠᴇ
> *┣➢*  ᴡɪᴋɪᴘᴇᴅɪᴀ
> *┣➢*  ɢᴘᴀss
> *┣➢*  ɢɪᴛʜᴜʙsᴛᴀʟᴋ
> *┣➢*  ʏᴛs
> *┣➢*  ʏᴛᴠ
> *╰⭑━━➤*  *𝚆𝙰 𝙱𝙾𝚃 𝟸𝟶𝟸𝟻-𝟸𝟶𝟸𝟼*
> *ᴘᴏᴡᴇʀᴇᴅ ʙʏ ᴅᴇᴠ ᴘʀᴏғ xᴛʀᴇᴍᴇ*`;
    //SEND AUDIO 
    haiko.sendMessage(from, { audio: { url: `https://files.catbox.moe/6ifekx.mp3` }, caption: haikomenu })
    
await haiko.sendMessage(from, {
      image: { url:`https://files.catbox.moe/eafhsi.jpg`},
      caption: haikomenu,
      contextInfo: {
        mentionedJid: [m.sender],
        forwardingScore: 999,
        isForwarded: true,
        forwardedNewsletterMessageInfo: {
          newsletterJid: '120363398101781980@newsletter',
          newsletterName: '𝐏𝐑𝐎𝐅-𝐗𝐓𝐑𝐄𝐌𝐄',
          serverMessageId: 143
        }
      }
    }, { quoted: mek });

    
  } catch (e) {
    console.error(e);
    reply(`❌ Error: ${e.message}`);
  }
});
